Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: མ་རིག་པ་ཡི་རྐྱེན་ལས་འབྱུང་བ་ཡིན། །
en: They come to be because of ignorance.

source: མ་རིག་འདི་ནི་ཡོད་པ་མ་ཡིན་ཏེ། །
en: This ignorance, too, is not existent.

source: དེ་བས་ངས་ནི་མ་རིག་འདི་བཤད་དོ། །
en: Therefore, I teach that this is ignorance.

source: འདུ་བྱེད་རྣམ་ཤེས་མིང་དང་གཟུགས་བཅས་དང་། །སྐྱེ་མཆེད་དྲུག་དང་རེག་དང་ཚོར་བ་དང་། །སྲེད་དང་ལེན་དང་དེ་བཞིན་སྲིད་པ་དང་། །སྐྱེ་དང་རྒ་ཤི་མྱ་ངན་གནོད་པ་རྣམས། །འཁོར་བའི་སྡུག་བསྔལ་བསམ་གྱིས་མི་ཁྱབ་པ། །
en: “Formations, consciousness, and name and form; The six āyatanas, contact, and sensation; Craving, grasping and likewise becoming; And the misfortunes of birth, aging, death, and misery— “Those inconceivable sufferings in saṃsāra That are present in the wheel of saṃsāra Have happened without happening and have no origination.

source: འཁོར་བའི་འཁོར་ལོ་ཇི་ལྟར་གནས་པ་དག །མ་བྱུང་བ་ལས་བྱུང་དང་མི་འབྱུང་དང་། །ཚུལ་བཞིན་མ་ཡིན་སེམས་ཀྱིས་རྣམ་དཔྱད་དང་། །བདག་གི་ལྟ་བར་གྱུར་པ་གཅད་པར་བགྱིས། །
en: The distinctions made by an erroneous mind, “And the view that there is a self, should be cut through.

source: ཡེ་ཤེས་རལ་གྲིས་ཉོན་མོངས་རྒྱ་མོ་དྲོལ། །
en: Cut through the net of the kleśas with the sword of wisdom.

source: ཕུང་པོའི་གནས་ལ་སྟོང་པར་གྱུར་པར་ལྟོས། །
en: See that the basis of the skandhas is empty.

source: བྱང་ཆུབ་ཡོན་ཏན་རྒྱ་ཆེན་རེག་པར་གྱིས། །
en: Reach the vast qualities of the buddhas.

source: ངས་ནི་བདུད་རྩི་གྲོང་ཁྱེར་སྒོ་ཡང་ཕྱེ། །
en: “I have opened the gate of the city of amṛta.

source: བདུད་རྩིའི་ཁུ་བའི་སྣོད་ཀྱང་ཀུན་ཏུ་བསྟན། །
en: I have shown everyone the vessel of amṛta liquid.

source: ངས་ནི་བདུད་རྩིའི་གྲོང་ཁྱེར་གནས་དེར་འཇུག །ངས་ནི་བདུད་རྩིའི་ཁུ་བས་བདག་ཚིམ་བྱས། །
en: I have entered the place that is the city of amṛta, And I have been satiated by the amṛta liquid.

source: ངས་ནི་ཆོས་ཀྱི་རྔ་ཆེན་དམ་པ་བརྡུངས། །ངས་ནི་ཆོས་ཀྱི་དུང་གི་མཆོག་ཀྱང་བུས། །
en: “I have beaten the sublime great drum of the Dharma I have blown the sublime conch of the Dharma.

source: ངས་ནི་ཆོས་ཀྱི་སྒྲོན་མ་མཆོག་འབར་བྱས། །ངས་ནི་ཆོས་ཀྱི་ཆར་པ་དམ་པ་ཕབ། །
en: I have lit the sublime lamp of the Dharma, And I have sent down a sublime rain of Dharma.

source: ངས་ནི་ཉོན་མོངས་དགྲ་ཚོགས་རྣམས་ལས་རྒྱལ། །
en: “I have defeated the supreme enemy, the kleśas.

source: ངས་ནི་ཆོས་ཀྱི་རྒྱལ་མཚན་དམ་པ་བསྒྲེང་། །
en: I have raised the sublime banner of the Dharma.

source: སྲིད་པའི་མཚོ་ལས་སེམས་ཅན་རབ་ཏུ་བསྒྲལ། །
en: I have brought beings across the ocean of existence.

source: ངས་ནི་ངན་སོང་གསུམ་གྱི་ལམ་རྣམས་བཀག །
en: I have blocked the road to the three lower existences.

source: སེམས་ཅན་ཉོན་མོངས་མེ་ཡིས་གདུངས་གྱུར་པ། །རྟེན་མེད་གྱུར་ཅིང་དཔུང་གཉེན་མེད་པ་དག །
en: “There are beings who are tormented by the fire of the kleśas, Who have no support or protector.

source: སྲོག་ཆགས་ཉོན་མོངས་མེས་གདུངས་ཞི་བྱས་ནས། །བདུད་རྩི་ཁུ་བ་བསིལ་བས་ཚིམ་པར་བྱས། །
en: I have extinguished the fire of the kleśas in those beings And brought them relief with the cooling liquid of amṛta.

source: གང་ཕྱིར་བསྐལ་བ་དུ་མར་སྔོན་ཆད་ངས། །འདྲེན་པ་བསམ་གྱིས་མི་ཁྱབ་མཆོད་པ་བྱས། །ཆོས་ཀྱི་སྐུ་དེ་ཡོངས་སུ་ཚོལ་བ་ན། །བརྟུལ་ཞུགས་བརྟན་པས་བྱང་ཆུབ་ཕྱིར་སྤྱད་དེ། །
en: “For that reason, through many past eons I made offerings to innumerable guides, And in seeking for the Dharma body I practiced resolute discipline for the sake of enlightenment.

source: ལག་པ་དང་ནི་མིག་དང་རྐང་པ་དང་། །ཡན་ལག་མཆོག་དང་བུ་སྡུག་བུ་མོ་དང་། །ནོར་དབྱིག་ནོར་བུ་མུ་ཏིག་རྒྱན་དང་གསེར། །བཻ་ཌཱུརྱ་དང་རིན་ཆེན་སྣ་ཚོགས་བཏང་། །སྟོང་གསུམ་ཤིང་ལྗོན་ཐམས་ཅད་དང་། །རྩྭ་དང་རྩྭ་རྣམས་ཐམས་ཅད་དང་། །
en: “I gave away my arms, eyes, and legs, My head, beloved sons and daughters, Wealth, treasures, ornamentations of jewels and pearls, Gold, beryl, and various kinds of jewels.

source: ནགས་ཚལ་དག་དང་ས་ལས་ནི། །འཁྲུངས་པ་ཐམས་ཅད་གཅད་གཏུབས་ཏེ། །དེ་དག་ཐམས་ཅད་ཕྱེར་བརླགས་ནས། །རབ་ཏུ་ཕྲ་བའི་རྡུལ་འདྲར་བྱས། །ནམ་མཁའི་དཀྱིལ་འཁོར་ཇི་ཙམ་པར། །ཕྱེ་མའི་ཕུང་པོ་སྤུངས་ནས་ནི། །འདི་ལ་ཆ་གསུམ་དབྱེ་བར་ནུས། །
en: “If all the trees in the trichiliocosm, And all the grasses, the plants, And the forests—everything that Grows from the ground—were to be cut down, “And they were all ground down And made into the smallest atoms And were formed into a heap of powder That reached the domain of the sky, “It would not be possible to divide that into portions.

source: ས་ལ་རྡུལ་ནི་ཡོད་པ་རྣམས། །སྟོང་གསུམ་དག་ནི་ཐམས་ཅད་ཀྱི། །རྡུལ་ཁམས་བསམ་གྱིས་མི་ཁྱབ་པ། །སེམས་ཅན་ཀུན་གྱིས་ཤེས་པ་གང་། །དེ་ནི་སེམས་ཅན་གཅིག་གིར་གྱུར། །ཤེས་པ་དེ་ཡིས་རྡུལ་རྣམས་ཀྱི། །ཕྱེ་མ་བགྲང་བར་བྱེད་ན་ནི། །སེམས་ཅན་ཀུན་ལས་རབ་འཕགས་པ། །ཡེ་ཤེས་རབ་ལྡན་མི་རྣམས་ཀྱིས། །ཐམས་ཅད་བགྲང་བར་ནུས་སྲིད་ཀྱི། །
en: There are the particles that exist in the earth— The countless elemental particles In all the trichiliocosm worlds— And if the knowledge of all beings Could become that of a single being, Such that with that knowledge All those particles could be counted, “Then the humans with that perfect wisdom, Who would be superior to all other beings, Could possibly count all those particles, But they would not be able to calculate a jina’s wisdom.

source: རྒྱལ་བའི་མཁྱེན་པ་མི་ནུས་སོ། །ཐུབ་པ་ཆེན་པོའི་ཡེ་ཤེས་གང་། །སྐད་ཅིག་གཅིག་ལ་འཇུག་པ་ཡང་། །བསྐལ་པ་བྱེ་བ་དུ་མར་ནི། །གང་དུའང་བགྲང་བར་མི་ནུས་སོ། །
en: “If they were to engage with a single instant Of the wisdom of the great Muni For many millions of eons, They would still be unable to calculate it.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས།
en: This concludes “Emptiness,” the ninth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: སྟོང་པ་ཉིད་ཀྱི་ལེའུ་ཞེས་བྱ་སྟེ་དགུ་པའོ།། །།དེ་ནས་ལྷ་མོ་རིན་ཆེན་འོད་འཕྲོས་ཆོས་བསྟན་པ་ཤིན་ཏུ་ཟབ་མོ་དེ་ཐོས་ནས། དགའ་བ་དང་རངས་པ་སྐྱེས་ཏེ། འཁོར་འདུས་པ་དེའི་ནང་ནས་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས།
en: Chapter 10: Fulfilling Wishes on the Basis of Emptiness On hearing that very profound Dharma teaching, the goddess Ratnārcī was delighted and overjoyed.

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བསྟན་པ་ཟབ་མོ་འདི་ལ་ཇི་ལྟར་རྣལ་འབྱོར་དུ་བྱ་བ་ཞུ་བའི་ཕྱིར། བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ། རྒྱལ་བ་རྐང་གཉིས་གཙོ་ལགས་ཏེ། །འཇིག་རྟེན་ཀུན་ཏུ་སྣང་མཛད་པ། །བྱང་ཆུབ་སྤྱོད་པ་ཡང་དག་ཚུལ། །
en: She rose from her seat, and, with her upper robe over one shoulder, knelt on her right knee, placed her palms together in homage, bowed toward the Bhagavat, and in order to ask how to practice this profound teaching, spoke these verses to the Bhagavat: “Jina, supreme two-legged being Who completely illuminates the world, I pray that with compassion you teach me The correct way of enlightened conduct.”

source: བདག་ལ་ཐུགས་རྗེས་བཤད་དུ་གསོལ། །རིགས་ཀྱི་ལྷ་མོ་ལ་བཀའ་སྩལ་པ། ཁྱོད་ལ་ཐེ་ཚོམ་ཅི་ཡོད་པ། །འདྲི་བའི་དོན་དེ་ཞུས་ཤིག་དང་། །རྣམ་པར་ཕྱེ་སྟེ་བསྟན་པར་བྱ། །
en: He replied to the noble goddess: “Whatever doubts you have, Ask questions about that meaning And I will elucidate and teach it.”

source: དེ་ནས་ཡང་རིགས་ཀྱི་ལྷ་མོས་བཅོམ་ལྡན་འདས་ལ་གསོལ་བ། བདག་དང་གཞན་ལ་ཕན་གདགས་ཕྱིར། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ནི། །འཁོར་དང་མྱ་ངན་འདས་བྲལ་བའི། །བྱང་ཆུབ་སྤྱོད་པ་ཇི་ལྟར་སྤྱད། །
en: Then the noble goddess said to the Bhagavat: “For the benefit of myself and others: How do the bodhisattvas Practice the enlightened conduct That is free of saṃsāra and nirvāṇa?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རིགས་ཀྱི་ལྷ་མོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ལྷ་མོ་ཆོས་ཀྱི་དབྱིངས་ལ་གནས་ཏེ། བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་སྤྱད་པས་ན། མཉམ་པ་ཉིད་ལ་ནན་ཏན་དུ་བྱའོ། །
en: The Bhagavat then said to the noble goddess: “Goddess, be dedicated to sameness Through practicing enlightened conduct While dwelling in the Dharma realm.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: That is what he said to her.

source: རིགས་ཀྱི་ལྷ་མོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ཆོས་ཀྱི་དབྱིངས་ལ་གནས་ཏེ། བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་ཅིང་མཉམ་པ་ཉིད་ལ་ནན་ཏན་དུ་བགྱི་བ་ལགས།
en: The noble goddess asked the Bhagavat, “Bhagavat, how does one practice equanimity by performing enlightened conduct while dwelling in the Dharma realm?”

source: བཀའ་སྩལ་པ། ལྷ་མོ་དེ་ནི་ཕུང་པོ་ལྔ་ལ་ཆོས་ཀྱི་དབྱིངས་སུ་འདོགས་ཏེ། ཆོས་ཀྱི་དབྱིངས་ནི་ཕུང་པོ་ལྔ་ཉིད་དོ། །
en: “Goddess,” replied the Bhagavat, “the five skandhas are said to be the Dharma realm, and the Dharma realm is the five skandhas.

source: ཕུང་པོ་ལྔ་ཡང་བརྗོད་དུ་མེད་པ། ཕུང་པོ་ལྔ་མ་ཡིན་པ་ཡང་བརྗོད་དུ་མེད་པ་སྟེ།
en: However, one cannot say it is the five skandhas and one cannot say it is not the five skandhas.

source: དེ་ལ་ཆོས་ཀྱི་དབྱིངས་དེ་ཉིད་ཕུང་པོ་ལྔ་ཡིན་ན་ནི་ཆད་པར་འགྱུར་རོ། །
en: If the Dharma realm itself were the five skandhas, that would be nihilism.

source: གལ་ཏེ་ཕུང་པོ་ལྔ་ལས་གཞན་པར་འདོད་ན་ནི་རྟག་པར་འགྱུར་ཏེ།
en: If one were to state that it is other than the five skandhas, that would be eternalism.

source: མཚན་མ་གཉིས་དང་བྲལ་བ།
en: It is devoid of both characteristics.

source: མཐའ་གཉིས་ལ་མི་གནས་པ།
en: It does not dwell in either of the two extremes.

source: བལྟར་མེད་པ། བལྟ་བར་བྱ་བ་ལས་འདས་པ།
en: It cannot be viewed; it transcends being an object of view.

source: མིང་དང་མཚན་མ་མེད་པ་དེ་ནི་ཆོས་ཀྱི་དབྱིངས་ཞེས་བརྗོད་དོ། །
en: It has no name or feature. That is what is called the Dharma realm.

source: རིགས་ཀྱི་ལྷ་མོ་ཕུང་པོ་ལྔ་ལ་ཆོས་ཀྱི་དབྱིངས་སུ་ཇི་ལྟར་གདགས་ཞེ་ན།
en: “Family goddess, why are the five skandhas called the Dharma realm?

source: ཕུང་པོ་ལྔ་དེ་ནི་རྒྱུ་དང་རྐྱེན་གྱིས་མ་བསྐྱེད་པ་དེ།
en: The five skandhas are not produced through causes and conditions.

source: དེ་ཡང་གལ་ཏེ་རྒྱུ་དང་རྐྱེན་ལས་སྐྱེ་བ་ཞིག་ཡིན་ན་ནི། སྐྱེས་ཟིན་པ་སྐྱེའམ། མི་སྐྱེ་བ་སྐྱེ་ཞེས་བྱ།
en: If they were produced by causes and conditions, they would be either that which has been produced that is being produced, or that which is not produced that is being produced.

source: གལ་ཏེ་སྐྱེས་ཟིན་པ་སྐྱེ་ན་ནི། རྒྱུ་དང་རྐྱེན་ཀྱང་མི་དགོས་པའི་རིགས་སོ། །
en: If they were a production of what has already been produced, it is logical that causes and conditions would not be needed.

source: གལ་ཏེ་མ་སྐྱེས་པ་སྐྱེ་ན་ནི། སྐྱེ་བ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །
en: If they were that which is not produced that is being produced, then there would be no perceivable production.

source: གང་མ་སྐྱེས་པའི་ཆོས་རྣམས་ནི་ཡོད་པ་མ་ཡིན་པ་ཉིད་པས་མིང་མེད་པ་མཚན་མ་མེད་པ།
en: Unproduced phenomena are not existent, and therefore they have no names and no features.

source: གཞལ་བ་དང་། དཔག་པ་དང་། དཔེར་བྱ་བས་མི་བརྗོད་པ་སྟེ།
en: They cannot be evaluated, measured, or described through examples.

source: རྒྱུ་དང་རྐྱེན་གྱིས་བསྐྱེད་པར་བྱ་བ་མ་ཡིན་ནོ། །རིགས་ཀྱི་ལྷ་མོ་དཔེར་ན།
en: They are not produced by causes and conditions.

source: རྔའི་སྒྲ་ནི་ཤིང་དང་། ཀོ་བ་དང་། ལག་པ་ལ་བརྟེན་ཏེ་སྒྲ་འབྱུང་མོད་ཀྱི། རྔའི་སྒྲ་དེ་ནི་འདས་པ་ཡང་སྟོང་། མ་འོངས་པ་ཡང་སྟོང་།
en: “Noble goddess, a drumbeat originates through dependence on wood, skin, and a hand, but the drumbeat’s past is empty, its future is empty, and its present is empty.

source: ད་ལྟར་གནས་པ་ཡང་སྟོང་སྟེ། རྔའི་སྒྲ་དེ་ནི་ཤིང་ལས་མ་བྱུང་། ཀོ་བ་དང་ལག་པ་ལས་ཀྱང་མ་བྱུང་།
en: That drumbeat does not originate from the wood, and it does not originate from the skin or the hand.

source: དུས་གསུམ་གྱིས་མ་བསྐྱེད་པས་མི་སྐྱེ་བ་སྟེ།
en: It is not produced by the three times. Therefore, it is not produced.

source: གང་མི་སྐྱེ་བ་དེ་ནི་མི་འགོག་པའོ། །
en: That which is not produced does not cease.

source: གང་མི་འགོག་པ་དེ་ནི་གང་ནས་ཀྱང་མ་འོངས་པའོ། །
en: That which does not cease does not come from anywhere.

source: གང་ནས་ཀྱང་མ་འོངས་པ་དེ་ནི་གང་དུ་ཡང་མི་འགྲོ་བའོ། །
en: That which does not come from anywhere does not go anywhere.

source: གང་དུ་ཡང་མི་འགྲོ་བ་དེ་ནི་རྟག་པ་དང་ཆད་པ་མ་ཡིན་པས་གཅིག་པ་ཡང་མ་ཡིན།
en: That which does not go anywhere is neither eternal nor nothingness.

source: ཐ་དད་པ་ཡང་མ་ཡིན་པའོ། །
en: It is neither one nor separate.

source: གལ་ཏེ་གཅིག་པ་ཡིན་ན། ཆོས་ཀྱི་དབྱིངས་དང་ཐ་མི་དད་པས།
en: If the five skandhas were one with the Dharma realm, they would not be different from the Dharma realm.

source: འོ་ན་ནི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་ཀྱང་། དོན་དམ་པའི་བདེན་པ་མངོན་དུ་གྱུར་པས། མྱ་ངན་ལས་འདས་པའི་བདེ་བ་དམ་པ་ཐོབ་པར་འགྱུར་བ་ཞིག་ན།
en: Then childlike, ordinary beings would perceive the ultimate truth and attain the sublime bliss of nirvāṇa.

source: དེ་ལྟ་མ་ཡིན་པས་དེ་གཅིག་པ་མ་ཡིན་ནོ། །གལ་ཏེ་དེ་ཐ་དད་པ་ཡིན་ན་ནི། སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་ཡང་། མཚན་མ་དེ་ཉིད་འཛིན་པ་ཡིན་པས།
en: But it is not like that, so they are not one.

source: རྣམ་པར་གྲོལ་བར་ཡང་མི་འགྱུར་ཞིང་། ཉོན་མོངས་པའི་འཆིང་བ་དང་མ་བྲལ་བས། དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་མི་རྒྱའོ། །
en: “If they were separate from the Dharma realm then the conduct of the buddhas and bodhisattvas would have their same characteristics and they would not become liberated from the bondage of the kleśas and they would not attain the highest, most complete enlightenment of buddhahood.

source: འཕགས་པ་རྣམས་ནི་འདུ་བྱེད་དང་། འདུ་བྱེད་མ་ཡིན་པ་ཡང་དག་པའི་ངོ་བོར་གཅིག་པའི་ཕྱིར་ཐ་དད་པ་མ་ཡིན་ནོ། །
en: It is because the āryas have the single nature of the composite and noncomposite, and therefore they are not different.

source: དེ་བས་ན་ཕུང་པོ་ལྔ་པོ་དེ་ནི་ཡོད་པ་ཡང་མ་ཡིན། མེད་པ་ཡང་མ་ཡིན།
en: Therefore, the five skandhas are neither existent nor nonexistent.

source: རྒྱུ་དང་རྐྱེན་གྱིས་བསྐྱེད་པ་ཡང་མ་ཡིན། རྒྱུ་དང་རྐྱེན་མེད་པས་བསྐྱེད་པ་ཡང་མ་ཡིན་པ།
en: They are neither produced by causes and conditions, nor not produced by causes and conditions.

source: ཚིག་གིས་ཐོག་ཏུ་མི་ཕེབས་པ།
en: Words cannot reach this.

source: མིང་དང་མཚན་མ་མེད་པ།
en: It has no name or features.

source: རྒྱུ་དང་རྐྱེན་མེད་པ།
en: It has no cause or condition.

source: དཔེས་བསྟན་དུ་མེད་པ།
en: It cannot be taught through examples.

source: ཐོག་མ་དང་ཐ་མར་དབེན་པ།
en: It is devoid of a beginning or an end.

source: རང་གི་ངང་གིས་སྟོང་པ་སྟེ།
en: It is naturally empty.

source: དེ་ནི་འཕགས་པ་རྣམས་ཀྱིས་མཁྱེན་པར་བྱ་བ་ཡིན་གྱི། གཞན་གྱི་སྤྱོད་ཡུལ་དུ་མ་གྱུར་པའོ། །
en: This is what the āryas know, but it is not within the field of experience of others.

source: དེ་བས་ན་ཕུང་པོ་ལྔ་ལ་ཆོས་ཀྱི་དབྱིངས་སུ་སྟོན་ཏོ། །
en: Therefore, the Dharma realm is taught through the five skandhas.

source: གཞན་ཡང་རིགས་ཀྱི་ལྷ་མོ་གང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དམ་པ་དང་། ཀུན་རྫོབ་གཞན་དང་གཞན་མ་ཡིན་པར་འདོད་པ་དེ་ནི་དཔག་པར་དཀའ་བ་སྟེ།
en: “Moreover, noble goddess, any noble son or noble daughter who wishes for the highest, most complete enlightenment, in which the ultimate and the relative are not anything other than each other, that is difficult to comprehend.

source: འཕགས་པ་དང་། མ་རབས་ཀྱི་སྤྱོད་ཡུལ་ནི་གཅིག་པ་དང་། ཐ་དད་པའི་རང་བཞིན་མ་ཡིན་ཏེ།
en: The nature of the fields of experience of āryas and lower beings are not one, nor are they different.

source: ཀུན་རྫོབ་ཀྱང་མ་སྤངས། དོན་དམ་པ་དང་ཡང་བྲལ་བར་མ་གྱུར་པ་དེ་ནི། ཆོས་ཀྱི་དབྱིངས་ལ་གནས་ཤིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའོ། །
en: Therefore the conduct of enlightenment should be practiced based on the Dharma realm, without eliminating the relative, and without being apart from the ultimate.”

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། རིགས་ཀྱི་ལྷ་མོ་དེ་རབ་ཏུ་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་སྟན་ལས་ལངས་ཏེ།
en: When the Bhagavat said that, the noble goddess was delighted and happy.

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས། ཐལ་མོ་སྦྱར་བས་བཏུད་དེ། སྤྱི་བོས་ཕྱག་འཚལ་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དེ་ལ་བདག་གིས་བསླབ་པར་འཚལ་ལོ། །
en: She rose from her seat, and, with her upper robe over one shoulder, knelt on her right knee, placed her palms together, bowed down her head in homage, and said to the Bhagavat, “Bhagavat, I will train in the bodhisattva conduct that the Bhagavat has taught.”

source: དེ་ནས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་ཆེན་པོ་འཁོར་འདུས་པ་དེའི་ནང་ན་འདུག་པས། རིགས་ཀྱི་ལྷ་མོ་རིན་ཆེན་འོད་འཕྲོ་ལ་འདི་སྐད་ཅེས་དྲིས་སོ། །ལྷ་མོ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཤིན་ཏུ་བསྒྲུབ་པར་དཀའ་བ་འདི་ཁྱོད་ཇི་ལྟར་སྤྱོད་པས་དེ་ལ་དབང་ཐོབ་པར་འགྱུར།
en: Then Mahābrahmā, the lord of Sahā, who was among that gathered assembly, asked the noble goddess Ratnārcī, “Goddess, how are you going to master through practice this bodhisattva conduct that is difficult to accomplish?”

source: དེ་ནས་རིགས་ཀྱི་ལྷ་མོས་ཚངས་པ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚངས་པའི་རྒྱལ་པོ་ཆེན་པོ་ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་དེ་ཤིན་ཏུ་ཟབ་པས་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ཀྱིས་དེའི་དོན་མི་ཤེས་ཏེ།
en: The noble goddess replied to Mahābrahmā, “Great Brahmarāja, the meaning that the Bhagavat has taught is very profound, so that no ordinary being can know its meaning.

source: འཕགས་པ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་བས། མཆོག་ཏུ་ཕྲ་བ་ཤེས་པར་དཀའ་བའོ། །
en: It is the field of experience of āryas, and therefore it is supremely subtle and difficult to know.

source: བདག་ནི་ཆོས་འདི་ལ་བརྟེན་ཏེ། བདེ་བར་གནས་པ་ཐོབ་བོ། །
en: I will attain a state of bliss through relying on this Dharma.

source: གལ་ཏེ་ཚིག་དེ་བདེན་པ་ལྟ་ན། སྙིགས་མ་ལྔའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་དག་ན། ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་གསེར་གྱི་ཁ་དོག་ཅན་དུ་གྱུར་ཏེ། མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པ། སྐྱེས་པ་ཡང་མ་ཡིན། བུད་མེད་ཀྱང་མ་ཡིན་པ་ཤ་སྟག་ཏུ་གྱུར་ཏེ།
en: If those words are true then may all the countless, innumerable, numberless beings in this world realm of the five degenerations become golden in color, possess the thirty-two signs, and be neither male nor female, while seated upon precious lotuses and enjoying limitless bliss.

source: རིན་པོ་ཆེའི་པདྨ་ལ་འདུག་ཅིང་། བདེ་བ་ཚད་མེད་པ་ལ་ལོངས་སྤྱོད་པ་དང་། ལྷའི་མེ་ཏོག་མཆོག་གི་ཆར་འབབ་ཅིང་། ལྷའི་སིལ་སྙན་དང་། རོལ་མོ་མ་དཀྲོལ་བར་རང་བྱུང་བའི་མཆོད་པ་དེ་ལྟ་བུ་དང་ལྡན་པར་ཤོག་ཅིག་ཅེས་སྨྲས་མ་ཐག་ཏུ།
en: May there fall a rain of supreme divine flowers and may there be the spontaneously arising offering of music that resounds from divine musical instruments without their being played.”

source: སྙིགས་མ་ལྔའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན། སེམས་ཅན་ཇི་སྙེད་འཁོད་པ་དེ་དག་ཐམས་ཅད་གསེར་གྱི་ཁ་དོག་ཅན། སྐྱེས་བུ་ཆེན་པོའི་མཚན་དང་ལྡན་པ། སྐྱེས་པ་ཡང་མ་ཡིན། བུད་མེད་ཀྱང་མ་ཡིན་པར་གྱུར་ནས།
en: As soon as she had said that, all the beings present throughout the world realm of the five degenerations became golden in color, had the signs of a great being, were neither male nor female, were seated on precious lotuses, and enjoyed limitless bliss.

source: རིན་པོ་ཆེའི་པདྨ་ལ་འདུག་ཅིང་། བདེ་བ་ཚད་མེད་པས་ལོངས་སྤྱོད་པར་གྱུར་པ་ནི། ཇི་ལྟར་གཞན་འཕྲུལ་དབང་བྱེད་ལྷའི་གཞལ་མེད་ཁང་པ་ན།
en: It was just as in the palace of the Paranirmita­vaśavartin deities.

source: ངན་འགྲོ་ཐམས་ཅད་མེད་ཅིང་རིན་པོ་ཆེའི་ལྗོན་ཤིང་སྣ་ཚོགས་བྲེས་པ།
en: There were no lower existences. The world realm was beautified by a variety of precious trees.

source: རིན་པོ་ཆེ་སྣ་བདུན་གྱི་པདྨས་འཇིག་རྟེན་གྱི་ཁམས་ཁྱབ་པར་བྱས་པ།
en: It was covered by lotuses made of the seven precious materials.

source: རིན་པོ་ཆེ་སྣ་བདུན་དང་། ལྷའི་མེ་ཏོག་གི་ཆར་འབབ་པ། ལྷའི་རོལ་མོ་སྣ་ཚོགས་ཀྱིས་ལོངས་སྤྱོད་པར་གནས་པ་བཞིན་དུ་གྱུར་ཏོ། །
en: There fell a rain of the seven precious materials and divine flowers, and the beings remained, enjoying divine music of various kinds.

source: དེ་ནས་རིགས་ཀྱི་ལྷ་མོ་རིན་ཆེན་འོད་འཕྲོ་ཡང་བུད་མེད་ཀྱི་ལུས་ལས། ཚངས་པའི་ལུས་སུ་བསྒྱུར་ཅིང་འདུག་གོ། །
en: The noble goddess Cittaratnārcī also transformed from having a female body to having the body of Brahmā.

source: བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་འོད་འཕྲོ་ལ་ཚངས་པའི་རྒྱལ་པོས་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་ཁྱོད་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད།
en: Brahmarāja asked the bodhisattva Cittaratnārcī, “Venerable one, how did you practice bodhisattva conduct?”

source: སྨྲས་པ། ཚངས་པའི་རྒྱལ་པོ་ཆེན་པོ་ཆུའི་ཟླ་བ་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་བཞིན། བདག་ཀྱང་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་དོ། །
en: The bodhisattva Cittaratnārcī replied, “Great Brahmarāja, I practiced enlightened conduct like a moon on water would practice enlightened conduct.

source: རྨི་ལམ་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་བཞིན། བདག་ཀྱང་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་དོ། །
en: I practiced enlightened conduct like a dream would practice enlightened conduct.

source: སྨིག་རྒྱུ་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་བཞིན། བདག་ཀྱང་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་དོ། །
en: I practiced enlightened conduct like a mirage would practice enlightened conduct.

source: སྒྲ་བརྙན་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་བཞིན། བདག་ཀྱང་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་དོ། །
en: I practiced enlightened conduct like an echo would practice enlightened conduct.”

source: དེ་སྐད་ཅེས་བཤད་པ་ཚངས་པ་ཆེན་པོས་ཐོས་ནས། བྱང་ཆུབ་སེམས་དཔའ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་ཁྱོད་དོན་གང་ལ་གནས་ཏེ་ཚིག་དེ་སྐད་ཅེས་སྨྲ།
en: When Mahābrahmā heard that, he asked the bodhisattva, “Venerable one, based on what meaning did you say those words?”

source: ལྷ་མོས་སྨྲས་པ། ཚངས་པའི་རྒྱལ་པོ་ཆོས་གང་ཡང་བདེན་པའི་མཚན་ཉིད་དུ་མ་གྲུབ་ཅིང་། རྒྱུ་དང་རྐྱེན་ལ་བརྟེན་ནས་གྲུབ་པའི་ཕྱིར་རོ། །
en: The goddess replied, “Brahmarāja, any phenomenon has no existing characteristic of reality, because they are created through causes and conditions.”

source: ཚངས་པའི་རྒྱལ་པོས་སྨྲས་པ། གལ་ཏེ་དེ་ལྟ་ན་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བའི་རིགས་སོ།
en: “If that is so,” said Brahmarāja, “then it would be logical that all ordinary beings would attain the highest, most complete enlightenment of buddhahood.”

source: སྐྱེས་བུ་ཁྱོད་ཅིའི་ཕྱིར། དེ་སྐད་ཅེས་སྨྲ།
en: “Sir, why do you say that?”

source: བྱིས་པ་ཡང་གཞན། མཁས་པ་ཡང་གཞན།
en: asked the goddess.

source: བྱང་ཆུབ་ཀྱང་གཞན། བྱང་ཆུབ་མ་ཡིན་པ་ཡང་གཞན། རྣམ་པར་གྲོལ་བ་ཡང་གཞན། རྣམ་པར་གྲོལ་བ་མ་ཡིན་པ་ཡང་གཞན་མ་ཡིན་མོད་ཀྱི་ཚངས་པ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ནི། ཆོས་ཀྱི་དབྱིངས་སུ་མཉམ་པ་ཉིད་དེ་སོ་སོ་མ་ཡིན་པ།
en: “Although childlike beings are one thing and the wise are another, although enlightenment is one thing and nonenlightenment another, although liberation is one thing and nonliberation another, still, Brahmarāja, they are all the same and not separate in the Dharma realm.

source: ཡང་དག་པར་དབྱེར་མེད་པ། བར་མཚམས་མེད་པ། འཕེལ་བ་དང་། འགྲིབ་པ་མེད་པ་ལ་མངོན་པར་ཆགས་ཤིང་འཛིན་ཏོ། །ཚངས་པའི་རྒྱལ་པོ་དཔེར་ན། སྒྱུ་མ་མཁན་ནམ། དེའི་སློབ་མ་སྒྱུ་མ་སྤྲུལ་པ་ལ་མཁས་ཤིང་བྱང་བར་གྱུར་པ་ཞིག་གིས། ལམ་གྱི་བཞི་མདོར། ས་དང་།
en: They remain and are fixed as truly inseparable; there is no gap between them, and they have no increase or decrease.

source: བྱེ་མ་དང་། ཤིང་དང་། རྩྭ་དང་།
en: “O Brahmarāja!

source: ལོ་མ་ལ་སོགས་པ་གནས་གཅིག་ཏུ་བསྡུས་ཏེ། སྒྱུ་མ་སྤྲུལ་པ་འདི་ལྟ་སྟེ། རྟ་དང་གླང་པོ་ཆེའི་ཚོགས་དང་། དམག་དང་ཤིང་རྟ་ལ་སོགས་པའི་ཚོགས་དང་། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཕུང་པོ་དང་། བང་བ་དང་མཛོད་ལ་སོགས་པ་རྣམ་པ་སྣ་ཚོགས་ཀུན་ལ་སྟོན་ཏོ། །
en: It is like a conjurer, or a conjurer’s pupil, who is skilled and trained in manifesting illusions, and who, at a crossroads, gathers into one place earth, sand, wood, plants, leaves, and so on, and creates magical illusions of various kinds, such as herds of horses and elephants, soldiers and chariots, and so on, and a heap of the seven precious materials, and various other kinds of treasure.

source: དེ་ལ་སེམས་ཅན་བྱིས་པ་བླུན་པོ་མི་ཤེས་པའི་རང་བཞིན་ཅན་དག་གིས་མཐོང་ན། སྒྱུ་མ་སྤྲུལ་པར་མི་ཤེས་ཏེ། རྟ་དང་གླང་པོ་ཆེ་ལ་སོགས་པ་མཐོང་བ་དང་། ཐོས་པ་འདི་དག་ནི་ཡང་དག་པར་ཡོད་པ་ཡིན་ཏེ། གཞན་ནི་བརྫུན་པ་སྙམ་དུ་སེམས་ཤིང་།
en: When the childlike, stupid, and ignorant see them, they do not know that they are illusions, and they think, ‘The horses, elephants, and so on that I see and hear are real, and anything else is a lie!’

source: ཕྱིས་ཀྱང་དེ་ལ་ཞིབ་ཏུ་རྟོག་པར་མི་བྱེད་དོ། །
en: Even afterward they don’t investigate it.

source: དེ་ལ་མཁས་པ་ཤེས་པའི་རང་བཞིན་ཅན་རྣམས་ནི་དེ་ལྟ་མ་ཡིན་ཏེ།
en: “Those who are wise and knowing are not like that.

source: སྒྱུ་མ་སྤྲུལ་པ་ཡིན་པར་ཤེས་ནས། ཐོས་པ་དང་མཐོང་བ་དེ་དག་ལ་འདི་སྙམ་དུ་སེམས་ཏེ། རྟ་དང་གླང་པོ་ཆེ་ལ་སོགས་པ་བདག་གིས་མཐོང་བ་འདི་དག་ནི་ཡང་དག་པ་མ་ཡིན་པ།
en: They know that they are magical illusions, so when they see and hear them, they think, ‘These horses, elephants, and so on that I see are not real.

source: སྒྱུ་མ་སྤྲུལ་པས་འགྲོ་བའི་མིག་སླུ་བར་བྱེད་པ་སྟེ།
en: It is a magical illusion that deceives the eyes of beings.

source: རྟ་དང་གླང་པོ་ཆེ་དང་། བང་མཛོད་ལ་སོགས་པ་འདི་དག་ནི་དེར་སྣང་བ་ཙམ་དུ་ཟད་དེ།
en: These horses, elephants, treasuries, and so on are nothing but appearances in that place.’
